In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
# Return a series of boolean value
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
# dropna - filter axis label based on if there are missing data
# fillna - fill in missing data with some value
# isnull - return boolean series indicating which value is missing/NA
# notnull - negation of isnull

In [7]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
# dropna() is the same as
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3]])

In [11]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned = data.dropna()

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.rand(7, 3))

In [16]:
# From the start to 4th row, column index = 1
df.iloc[:4, 1] = NA

# From the start to the 2nd row, column index = 2
df.iloc[:2, 2] = NA

In [17]:
df

          0         1         2
0  0.212592       NaN       NaN
1  0.959319       NaN       NaN
2  0.690357       NaN  0.638977
3  0.785325       NaN  0.879577
4  0.391014  0.808389  0.993040
5  0.062098  0.521398  0.068761
6  0.103238  0.176231  0.738984

In [18]:
df.dropna()

          0         1         2
4  0.391014  0.808389  0.993040
5  0.062098  0.521398  0.068761
6  0.103238  0.176231  0.738984

In [19]:
df.dropna(thresh=2)

          0         1         2
2  0.690357       NaN  0.638977
3  0.785325       NaN  0.879577
4  0.391014  0.808389  0.993040
5  0.062098  0.521398  0.068761
6  0.103238  0.176231  0.738984

In [20]:
df.fillna(0)

          0         1         2
0  0.212592  0.000000  0.000000
1  0.959319  0.000000  0.000000
2  0.690357  0.000000  0.638977
3  0.785325  0.000000  0.879577
4  0.391014  0.808389  0.993040
5  0.062098  0.521398  0.068761
6  0.103238  0.176231  0.738984

In [21]:
# call fillna with a dict and use different fill value for each column
df.fillna({1: 0.5, 2:0})

          0         1         2
0  0.212592  0.500000  0.000000
1  0.959319  0.500000  0.000000
2  0.690357  0.500000  0.638977
3  0.785325  0.500000  0.879577
4  0.391014  0.808389  0.993040
5  0.062098  0.521398  0.068761
6  0.103238  0.176231  0.738984

In [22]:
_ = df.fillna(0, inplace=True)

In [23]:
df

          0         1         2
0  0.212592  0.000000  0.000000
1  0.959319  0.000000  0.000000
2  0.690357  0.000000  0.638977
3  0.785325  0.000000  0.879577
4  0.391014  0.808389  0.993040
5  0.062098  0.521398  0.068761
6  0.103238  0.176231  0.738984

In [24]:
df = pd.DataFrame(np.random.randn(6, 3))

In [25]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [26]:
df

          0         1         2
0 -3.263704 -0.378045  0.595165
1  0.291267 -0.273593  0.819288
2 -0.709545       NaN  0.721572
3 -0.123652       NaN  0.363235
4 -0.424011       NaN       NaN
5 -0.396762       NaN       NaN

In [27]:
df.fillna(method='ffill')

          0         1         2
0 -3.263704 -0.378045  0.595165
1  0.291267 -0.273593  0.819288
2 -0.709545 -0.273593  0.721572
3 -0.123652 -0.273593  0.363235
4 -0.424011 -0.273593  0.363235
5 -0.396762 -0.273593  0.363235

In [28]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -3.263704 -0.378045  0.595165
1  0.291267 -0.273593  0.819288
2 -0.709545 -0.273593  0.721572
3 -0.123652 -0.273593  0.363235
4 -0.424011       NaN  0.363235
5 -0.396762       NaN  0.363235

In [29]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [30]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [31]:
data = pd.DataFrame({'k1':['one', 'two'] * 3 + ['two'],
                     'k2':[1, 1, 2, 3, 3, 4, 4]})

In [32]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
data['v1'] = range(7)

In [35]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [36]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [37]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [38]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'Pastrami', 'honey ham', 'noval lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     Pastrami     3.0
7    honey ham     5.0
8    noval lox     6.0

In [39]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'honey ham': 'pig',
    'noval lox': 'salmon',
    'corned beef': 'cow'
}

In [40]:
lowercased = data['food'].str.lower()

In [41]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8      noval lox
Name: food, dtype: object

In [42]:
data['animal'] = lowercased.map(meat_to_animal)

In [43]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     Pastrami     3.0     cow
7    honey ham     5.0     pig
8    noval lox     6.0  salmon

In [44]:
# Smarter / advanced way
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [45]:
data = pd.Series([1., -999, 2., -999., -1000., 3.])

In [46]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [47]:
data.replace(-999, NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [48]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [49]:
data.replace([-999, -1000], [NA, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
data.replace({-999: NA, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [52]:
transform = lambda x: x[:4].upper()

In [53]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [54]:
# Modifying the DataFrame in-place:
data.index = data.index.map(transform)

In [55]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [56]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [57]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [58]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [59]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [60]:
# Discretization and Binning

In [61]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

# Use a cut function in pandas
bins = [18, 25, 35, 60, 100]

In [62]:
cats = pd.cut(ages, bins)

In [63]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [64]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [65]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [66]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [67]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [68]:
data = np.random.rand(20)

In [69]:
pd.cut(data, 4, precision=2)

[(0.28, 0.5], (0.5, 0.73], (0.28, 0.5], (0.28, 0.5], (0.5, 0.73], ..., (0.05, 0.28], (0.28, 0.5], (0.5, 0.73], (0.73, 0.95], (0.05, 0.28]]
Length: 20
Categories (4, interval[float64]): [(0.05, 0.28] < (0.28, 0.5] < (0.5, 0.73] < (0.73, 0.95]]

In [70]:
data = np.random.randn(1000)

In [71]:
cats = pd.qcut(data, 4)

In [72]:
cats

[(-0.641, 0.0179], (0.671, 3.24], (-3.562, -0.641], (0.671, 3.24], (-0.641, 0.0179], ..., (0.0179, 0.671], (-0.641, 0.0179], (0.0179, 0.671], (0.671, 3.24], (0.671, 3.24]]
Length: 1000
Categories (4, interval[float64]): [(-3.562, -0.641] < (-0.641, 0.0179] < (0.0179, 0.671] < (0.671, 3.24]]

In [73]:
pd.value_counts(cats)

(0.671, 3.24]       250
(0.0179, 0.671]     250
(-0.641, 0.0179]    250
(-3.562, -0.641]    250
dtype: int64

In [74]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.234, 0.0179], (1.281, 3.24], (-1.234, 0.0179], (1.281, 3.24], (-1.234, 0.0179], ..., (0.0179, 1.281], (-1.234, 0.0179], (0.0179, 1.281], (0.0179, 1.281], (0.0179, 1.281]]
Length: 1000
Categories (4, interval[float64]): [(-3.562, -1.234] < (-1.234, 0.0179] < (0.0179, 1.281] < (1.281, 3.24]]

In [75]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [76]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.007785    -0.039504    -0.032261     0.003325
std       0.977525     0.970413     0.965658     1.032728
min      -3.307532    -3.051859    -3.291510    -3.358003
25%      -0.668591    -0.672735    -0.663371    -0.663626
50%      -0.002126    -0.035758    -0.009849     0.024041
75%       0.655240     0.630038     0.617752     0.689849
max       3.216720     2.954714     3.324810     3.648417

In [77]:
# Find the values in one of the columns exceeding 3 in absoulate value
col = data[2]

In [78]:
col.head(5)

0   -1.693127
1   -0.685583
2    1.356975
3    1.932751
4   -1.744367
Name: 2, dtype: float64

In [79]:
# Filter the rows where absolute values > 3
col[np.abs(col) > 3]

265    3.324810
299   -3.161560
457   -3.291510
575    3.159944
882   -3.239018
Name: 2, dtype: float64

In [80]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
16   3.079264 -0.121609  0.520652 -1.421498
30   3.216720  0.715528 -1.499921  0.394447
35  -3.307532 -0.200262 -1.092833 -0.681996
265 -0.165080  0.317407  3.324810 -1.550489
299 -0.009197  0.694320 -3.161560 -1.520183
408  0.947706 -0.117099 -0.108070  3.017971
457  0.123872  0.348813 -3.291510  0.195595
538 -0.593451 -0.406376 -0.974514  3.648417
575  0.895770 -1.039307  3.159944  1.313986
581 -0.407503 -3.051859 -1.484718 -0.887398
720  3.043327 -0.660758 -1.359222 -0.113206
821  3.164262  0.894674 -1.727766 -1.999429
851  0.477453  0.415158  0.586206 -3.034403
868  0.233999 -0.808510  1.540661 -3.358003
882 -0.734461  0.931873 -3.239018  0.588065

In [81]:
# Cap the values between -3 and 3
data[np.abs(data) > 3] = np.sign(data) * 3

In [82]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.007589    -0.039453    -0.032054     0.003051
std       0.974941     0.970254     0.961843     1.029378
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.668591    -0.672735    -0.663371    -0.663626
50%      -0.002126    -0.035758    -0.009849     0.024041
75%       0.655240     0.630038     0.617752     0.689849
max       3.000000     2.954714     3.000000     3.000000

In [83]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1 -1.0 -1.0 -1.0  1.0
2 -1.0  1.0  1.0  1.0
3 -1.0  1.0  1.0  1.0
4  1.0 -1.0 -1.0 -1.0

In [84]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [85]:
sampler = np.random.permutation(5)

In [86]:
sampler

array([0, 1, 4, 2, 3])

In [87]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [88]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15

In [89]:
# or using the old method
df.iloc[sampler]

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15

In [90]:
# or yet another way
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15

In [91]:
# Get sample with replacement
choice = pd.Series([5, 7, -1, 6, 4])
draws = choice.sample(n=10, replace=True)
draws

4    4
0    5
3    6
1    7
1    7
3    6
3    6
0    5
1    7
1    7
dtype: int64

In [92]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [93]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [94]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [95]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [96]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [97]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_csv('./pydata-book/datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames, engine='python')

In [98]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [99]:
# Get the list of unique genres in the dataset
all_genres = []

# Looping the array of genres
for x in movies.genres:
    # Appending a list of genres into the master list (all_genres)
    all_genres.extend(x.split('|'))

In [100]:
# A quick way to deduplicates and create a nparray
genres = pd.unique(all_genres)

In [101]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [102]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [103]:
zero_matrix.shape

(3883, 18)

In [104]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [105]:
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [106]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [107]:
# This loop the dataframe one row at a time,
# determine which genre index to set to 1
for i, gen in enumerate(movies.genres):
    # Return a list of indices where the indicator should set to 1
    indices = dummies.columns.get_indexer(gen.split('|'))
    # assign 1 to that position using index locate[] ...
    dummies.iloc[i, indices] = 1

In [108]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [109]:
movies_windic.head(2)

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [110]:
# Combine get_dummies with a descretization function like cut
np.random.seed(12345)

In [111]:
values = np.random.rand(10)

In [112]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [113]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [114]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [115]:
# String Manipulations with Pandas!

In [116]:
# Break the comma separated string into pieces (list of strings)
val = 'a,b,     guide'
val.split(',')

['a', 'b', '     guide']

In [117]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guide']

In [118]:
first, second, third = pieces

In [119]:
first + '::' + second + '::' + third

'a::b::guide'

In [120]:
'::'.join(pieces)

'a::b::guide'

In [121]:
'guide' in val

True

In [122]:
val.index(',')

1

In [123]:
val.find(':')

-1

In [124]:
val.count(',')

2

In [125]:
val.replace(',', '::')

'a::b::     guide'

In [126]:
val.replace(',', '')

'ab     guide'

In [127]:
import re
text = 'foo      bar\t  baz \tqux'
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [128]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [129]:
regex.findall(text)

['      ', '\t  ', ' \t']

In [130]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-0.-]+\.[A-Z]{2,4}'

# re.IGNORECASE make the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [131]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [132]:
m = regex.search(text)

In [133]:
text[m.start():m.end()]

'dave@google.com'

In [134]:
m.group()

'dave@google.com'

In [135]:
print(m)

<re.Match object; span=(5, 20), match='dave@google.com'>

In [136]:
print(regex.match(text))

None

In [137]:
print(regex.sub('*'*10, text))

Dave **********
Steve **********
Rob **********
Ryan **********

In [138]:
pattern = r'([A-Z0-0]+)@([A-Z0-9]+)\.([A-Z]{2,4})'

In [139]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [140]:
m = regex.match('wesm@bright.net')

In [141]:
m.groups()

('wesm', 'bright', 'net')

In [142]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [143]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [144]:
# Vectorized String Function in Pandas
data = {'Dave': 'dave@google.com', 
        'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com',
        'Wes': 'np.nan'}

In [145]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': 'np.nan'}

In [146]:
data = pd.Series(data)

In [147]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes               np.nan
dtype: object

In [148]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes      False
dtype: bool

In [149]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes      False
dtype: bool

In [150]:
pattern = r'([A-Z0-9]+)@([A-Z0-9]+)\.([A-Z0-9]{2,4})'
regex = re.compile(pattern, re.IGNORECASE)

matches = data.str.findall(regex).str[0]
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [151]:
data.str.findall(regex)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                         []
dtype: object

In [152]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [153]:
# You can use slice too!
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes      np.na
dtype: object

In [154]:
data.str.extract(regex)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [155]:
simple_dict = {'a': {1: 'apple apple'},
               'b': {2: 'banana'},
               'c': {3: 'cat cat cat'}}

df = pd.DataFrame(simple_dict, index=np.arange(3))

In [156]:
df

             a       b   c
0          NaN     NaN NaN
1  apple apple     NaN NaN
2          NaN  banana NaN

In [157]:
# Chapter 8: Data Wrangling: Join, Combine and Reshape

In [158]:
# Hierarchical Indexing
data = pd.Series(np.random.randn(9),
                 index=['a a a b b c c d d'.split(),
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

# The gap means use the label directly above
data

a  1    1.007189
   2   -1.296221
   3    0.274992
b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
d  2   -0.371843
   3    1.669025
dtype: float64

In [159]:
data.loc['a']

1    1.007189
2   -1.296221
3    0.274992
dtype: float64

In [160]:
data.loc['b'][3]

1.3529168351654497

In [161]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [162]:
data['b']

1    0.228913
3    1.352917
dtype: float64

In [163]:
data['b':'c']

b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
dtype: float64

In [164]:
data.loc[['b', 'd']]

b  1    0.228913
   3    1.352917
d  2   -0.371843
   3    1.669025
dtype: float64

In [165]:
data.loc[:, 1]

a    1.007189
b    0.228913
c    0.886429
dtype: float64

In [166]:
data.unstack()

          1         2         3
a  1.007189 -1.296221  0.274992
b  0.228913       NaN  1.352917
c  0.886429 -2.001637       NaN
d       NaN -0.371843  1.669025

In [167]:
data.unstack().stack()

a  1    1.007189
   2   -1.296221
   3    0.274992
b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
d  2   -0.371843
   3    1.669025
dtype: float64

In [168]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])

In [169]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [170]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

In [171]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [172]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [173]:
# Create a multiIndex and reuse later
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']],
                           names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           codes=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [174]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [175]:
# Swap the row's multi-Index
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [176]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [177]:
frame.sum(level='key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [178]:
my_dict = {'a': range(7),
           'b': range(7, 0, -1),
           'c': 'one one one two two two two'.split(),
           'd': [0, 1, 2, 0, 1, 2, 3]}
frame = pd.DataFrame(my_dict)

In [179]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [180]:
# set_index
frame2 = frame.set_index(['c', 'd'])

In [181]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [182]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [183]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [184]:
df1 = pd.DataFrame({'key': 'b b a c a a b'.split(),
                    'data1': range(7)})

In [185]:
df2 = pd.DataFrame({'key': 'a b d'.split(),
                    'data2': range(3)})

In [186]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [187]:
# Good practice to be explicit
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [188]:
df3 = pd.DataFrame({'l_key': 'b b a c a a b'.split(),
                    'data1': range(7)})
df4 = pd.DataFrame({'r_key': 'a b d'.split(),
                    'data2': range(3)})

pd.merge(df3, df4, left_on='l_key', right_on='r_key')

  l_key  data1 r_key  data2
0     b      0     b      1
1     b      1     b      1
2     b      6     b      1
3     a      2     a      0
4     a      4     a      0
5     a      5     a      0

In [189]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [190]:
df1 = pd.DataFrame({'key': 'b b a c a b'.split(),
                    'data1': range(6)})
df2 = pd.DataFrame({'key': 'a b a b d'.split(),
                    'data2': range(5)})

In [191]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [192]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [193]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [194]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                     'key2': ['one', 'one', 'one', 'two'],
                     'lval': [4, 5, 6, 7]})

In [195]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval_x  lval_y
0  foo  one     1.0     4.0
1  foo  one     1.0     5.0
2  foo  two     2.0     NaN
3  bar  one     3.0     6.0
4  bar  two     NaN     7.0

In [196]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval_x key2_y  lval_y
0  foo    one       1    one       4
1  foo    one       1    one       5
2  foo    two       2    one       4
3  foo    two       2    one       5
4  bar    one       3    one       6
5  bar    one       3    two       7

In [197]:
# Adding suffixes
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval_left key2_right  lval_right
0  foo       one          1        one           4
1  foo       one          1        one           5
2  foo       two          2        one           4
3  foo       two          2        one           5
4  bar       one          3        one           6
5  bar       one          3        two           7

In [198]:
# Merge on Index
left1 = pd.DataFrame({'key': 'a b a a b c'.split(),
                      'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [199]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [200]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
                               'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})

In [201]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
                              'Ohio', 'Ohio'],
                             [2001, 2002, 200, 2000, 2001, 2002]],
                      columns=['event1', 'evet2'])

In [202]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True)

     key1  key2  data  event1  evet2
0    Ohio  2000   0.0       6      7
1    Ohio  2001   1.0       8      9
2    Ohio  2002   2.0      10     11
3  Nevada  2001   3.0       0      1
4  Nevada  2002   4.0       2      3

In [203]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True, how='outer')

     key1  key2  data  event1  evet2
0    Ohio  2000   0.0       6      7
1    Ohio  2001   1.0       8      9
2    Ohio  2002   2.0      10     11
3  Nevada  2001   3.0       0      1
4  Nevada  2002   4.0       2      3
4    Ohio   200   NaN       4      5

In [204]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada'])

In [205]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13., 14.]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])

In [206]:
pd.merge(left2, right2, how='outer', 
         left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [207]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [208]:
left2.join(right2, how='inner')

   Ohio  Nevada  Missouri  Alabama
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [209]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [210]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                       index='a c e f'.split(),
                       columns='New York, Oregon'.split(sep=','))

In [211]:
another

   New York   Oregon
a       7.0      8.0
c       9.0     10.0
e      11.0     12.0
f      16.0     17.0

In [212]:
# You can use this to do multiple left join in a row,
# given they have the same index
# select * 
# from table1
#    left join table2 (Right2) on xyz
#    left join table3 (Right3) on xyz
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York   Oregon
a   1.0     2.0       NaN      NaN       7.0      8.0
c   3.0     4.0       9.0     10.0       9.0     10.0
e   5.0     6.0      13.0     14.0      11.0     12.0

In [213]:
# Concatenating Along An Axis
arr = np.arange(12).reshape((3, 4))

In [214]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [215]:
# Concat two array (stack vertically)
np.concatenate([arr, arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [216]:
# Concat two array (stack side by side)
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [217]:
s1 = pd.Series([0, 1], index=['a', 'b'])

In [218]:
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

In [219]:
s3 = pd.Series([5, 6], index=['f', 'g'])

In [220]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [221]:
# pd.concat([s1, s2, s3], axis=1)

In [222]:
s4 = pd.concat([s1, s3])

In [223]:
# pd.concat([s1, s4], axis=1)

In [224]:
pd.concat([s1, s4], axis=1, join='inner', sort=False)

   0  1
a  0  0
b  1  1

In [225]:
pd.concat([s1, s2], axis=1, 
          join_axes=[['a', 'c', 'b', 'e']])

     0    1
a  0.0  NaN
c  NaN  2.0
b  1.0  NaN
e  NaN  4.0

In [226]:
# What does s1 looks like?
s1

a    0
b    1
dtype: int64

In [227]:
s3

f    5
g    6
dtype: int64

In [228]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])

In [229]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [230]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [235]:
pd.concat([s1, s2, s3], axis=1, keys='one two three'.split(), sort=True)

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [236]:
# Creating 2 dataframes for example
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index='a b c'.split(),
                   columns='one two'.split())
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index='a c'.split(),
                   columns='three four'.split())

In [238]:
pd.concat([df1, df2], axis=1, keys='level_1, level_2'.split(), sort=True)

  level_1,     level_2
       one two   three four
a        0   1     5.0  6.0
b        2   3     NaN  NaN
c        4   5     7.0  8.0

In [240]:
pd.concat({'level_1': df1, 'level_2': df2}, axis=1, sort=True)

  level_1     level_2
      one two   three four
a       0   1     5.0  6.0
b       2   3     NaN  NaN
c       4   5     7.0  8.0

In [242]:
pd.concat([df1, df2], axis=1, keys='level_1 level_2'.split(),
          names='upper lower'.split(), sort=True)

upper level_1     level_2
lower     one two   three four
a           0   1     5.0  6.0
b           2   3     NaN  NaN
c           4   5     7.0  8.0

In [243]:
# When the row index does not contain any relevant data
df1 = pd.DataFrame(np.random.randn(3, 4), 
                   columns='a b c d'.split())

In [244]:
df1

          a         b         c         d
0 -0.438570 -0.539741  0.476985  3.248944
1 -1.021228 -0.577087  0.124121  0.302614
2  0.523772  0.000940  1.343810 -0.713544

In [245]:
df2 = pd.DataFrame(np.random.rand(2, 3),
                   columns='b d e'.split())

In [246]:
df2

          b         d         e
0  0.468106  0.459373  0.709510
1  0.178053  0.531450  0.167742

In [248]:
pd.concat([df1, df2], sort=True)

          a         b         c         d         e
0 -0.438570 -0.539741  0.476985  3.248944       NaN
1 -1.021228 -0.577087  0.124121  0.302614       NaN
2  0.523772  0.000940  1.343810 -0.713544       NaN
0       NaN  0.468106       NaN  0.459373  0.709510
1       NaN  0.178053       NaN  0.531450  0.167742

In [249]:
# Instead you should have used ignore index!
# Beucause otherwise your index will be "duplicated"

pd.concat([df1, df2], ignore_index=True, sort=True)

          a         b         c         d         e
0 -0.438570 -0.539741  0.476985  3.248944       NaN
1 -1.021228 -0.577087  0.124121  0.302614       NaN
2  0.523772  0.000940  1.343810 -0.713544       NaN
3       NaN  0.468106       NaN  0.459373  0.709510
4       NaN  0.178053       NaN  0.531450  0.167742

In [250]:
a = pd.Series([np.nan, 2.5, 0.0, 3.5, 4.5, np.nan],
              index='f e d c b a'.split())

b = pd.Series([0., np.nan, 2., np.nan, np.nan, 5.],
              index='a b c d e f'.split())

In [251]:
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [252]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [253]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [254]:
b.combine_first(a)

a    0.0
b    4.5
c    2.0
d    0.0
e    2.5
f    5.0
dtype: float64

In [255]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    'b': [np.nan, 2., np.nan, 6.],
                    'c': range(2, 18, 4)})

df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [256]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    'b': [np.nan, 3., 4., 6., 8.]})

In [257]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [260]:
# stack
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index('Ohio, Colorado'.split(), name='state'),
                    columns=pd.Index('one two three'.split(), name='number'))

In [261]:
my_index = pd.Index('Ohio Colorado'.split(), name='state')
my_index

Index(['Ohio', 'Colorado'], dtype='object', name='state')

In [262]:
my_columns = pd.Index('one two three'.split(), name='number')

In [263]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=my_index, columns=my_columns)

In [264]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [265]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [267]:
result.index

MultiIndex(levels=[['Ohio', 'Colorado'], ['one', 'two', 'three']],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]],
           names=['state', 'number'])

In [268]:
result['Ohio']

number
one      0
two      1
three    2
dtype: int64

In [271]:
# Access a multi-index
result[:, 'two']

state
Ohio        1
Colorado    4
dtype: int64

In [272]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [274]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [276]:
result.unstack(1)

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [279]:
# This is mind blow!!!
result.reset_index()

      state number  0
0      Ohio    one  0
1      Ohio    two  1
2      Ohio  three  2
3  Colorado    one  3
4  Colorado    two  4
5  Colorado  three  5

In [280]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [281]:
s1 = pd.Series([0, 1, 2, 3], index='a b c d'.split())
s2 = pd.Series([4, 5, 6], index='c d e'.split())
data2 = pd.concat([s1, s2], keys=['one', 'two'])

data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [282]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [284]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [285]:
df = pd.DataFrame({'left': result, 
                   'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))

In [286]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [287]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10